/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "Det markerade innehållet kunde inte spelas.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Det går inte att hitta något innehåll.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Det går inte att spela upp det aktuella spåret.";


/* kBRMediaNoContent*/
300 = "Inget innehåll hittades.";

/* kBRMediaNoPhotoContent */
301 = "Det finns inga bilder i iPhoto-biblioteket.";

/* kBRMediaNoPodcastContent */
302 = "Det finns inga podcaster i iTunes-biblioteket.";

/* kBRMediaNotDRMAuthorized */
303 = "Du är inte auktoriserad att spela upp det här innehållet.";

/* kBRMediaNoMovieFolderContent */
304 = "Det finns inga filmer att spela upp i mappen Filmer.";

/* kBRMediaNoTVShowContent */
305 = "Det finns inga tv-program i iTunes-biblioteket.";

/* kBRMediaNoMusicVideoContent */
306 = "Det finns inga musikvideor i iTunes-biblioteket.";

/* kBRMediaNoPlaylists */
307 = "Det finns inga spellistor i iTunes-biblioteket.";

/* kBRMediaNoSongContent */
308 = "Det finns inga låtar i iTunes-biblioteket.";

/* kBRMediaNoAudioBookContent */
309 = "Det finns inga ljudböcker i iTunes-biblioteket.";

/* kBRMediaEmptyPlaylist */
310 = "Det finns inga spår i spellistan.";

/* kBRMediaNoSuchPlaylist */
311 = "Den markerade spellistan hittades inte.";

/* kBRMediaNoSuchSong */
312 = "Det markerade spåret hittades inte.";

/* kBRMediaNoMovies */
315 = "Det finns inga filmer i mappen Filmer.";

/* kBRMediaNoSongForSlideshow */
316 = "Spåret som hör till det här bildspelet kunde inte spelas upp.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Spåret som hör till det här bildspelet kunde inte spelas upp.";

/* kBRVideoUnplayable */
318 = "Det går inte att spela upp den markerade videon.";

/* kBRMediaRadioStreamUnplayable */
319 = "Radioströmmen du valde kan inte spelas.";

/* kBRRemoteMediaNoContent*/
350 = "Inget innehåll hittades i det här biblioteket.";

/* kBRRemoteMediaNoPhotoContent */
351 = "Det finns inga bilder i det här biblioteket.";

/* kBRRemoteMediaNoPodcastContent */
352 = "Det finns inga podcaster i det här biblioteket.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "Du är inte auktoriserad att spela upp det här innehållet.";

/* kBRRemoteMediaNoTVShowContent */
355 = "Det finns inga TV-program i det här biblioteket.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "Det finns inga musikvideor i det här biblioteket.";

/* kBRRemoteMediaNoPlaylists */
357 = "Det finns inga spellistor i det här biblioteket.";

/* kBRRemoteMediaNoSongContent */
358 = "Det finns ingen musik i det här biblioteket.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "Det finns inga ljudböcker i det här biblioteket.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "Det finns inga spår i spellistan.";

/* kBRRemoteMediaLoadingError */
361 = "Ett fel inträffade när innehållet lästes in.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "Bilddelningskällan är inte tillgänglig.";

/* kBRDataSourceInitializationFailure*/
400 = "Inget innehåll hittades.";

/* kBRDataSourceURLResolutionFailure*/
410 = "Inget innehåll hittades.";

/* kBRDataSourceConnectionInProgressError */
420 = "Försöker redan ansluta till källan.";


/* KBRSystemNetworkHostUnreachable */
501 = "Det går inte att ansluta till biblioteket.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "Den långa trailern kan inte spelas upp just nu.";

/* kBRSystemNotHDCPCompliant */
503 = "Det här innehållet kräver HDCP för uppspelning.";

/* kBRSetupCantSetLanguage */
600 = "Språket kunde inte ändras.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "En DVD-skiva kan inte spelas just nu.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "DVD-skivan kan inte matas ut.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "DVD-regionskoden matchar inte DVD-spelaren.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "DVD-skivan kan inte spelas upp.";

/* kBRDVDErrorFatalDVDAlert */
754 = "DVD-skivan kan inte spelas upp.";

/* kBRCDErrorCantEjectCDAlert */
755 = "CD-skivan kan inte matas ut.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "Skivans kopieringsskydd kan inte verifieras.";

/* kBRInternalResourceError */
900 = "Ett fel inträffade.";

